/******************************************************************************
文 件 名    HW02_01(if)
作    者    潘越
班    级	   物联网1601
学    号    U201614897
邮    箱    479773533@qq.com
课    程    C语言程序设计
作 业 号    习题2.1
截止日期    2017年4月14日

简述：
本程序实现输入工资金额，输出应收取税金额度。
******************************************************************************/
#include<stdio.h>

int main(void) {
	double x, fax;
	scanf("%lf", &x);
	/*主循环*/
	while (x != 0) {
		/*根据要求用if语句计算税金*/
		if (x <= 1000)
			fax = 0;
		else if (x <= 2000)
			fax = (x - 1000) * 0.05;
		else if (x <= 3000)
			fax = (x - 2000) * 0.1 + 1000 * 0.05;
		else if (x <= 4000)
			fax = (x - 3000) * 0.15 + 1000 * (0.1 + 0.05);
		else if (x <= 5000)
			fax = (x - 4000) * 0.2 + 1000 * (0.15 + 0.1 + 0.05);
		else
			fax = (x - 5000) * 0.25 + 1000 * (0.2 + 0.15 + 0.1 + 0.05);
		/*输出税金并输入下一轮数据*/
		printf("%lf\n", fax);
		scanf("%lf", &x);
	}
	return 0;
}