/******************************************************************************
文 件 名    HW02_06(自设题)
作    者    潘越
班    级	   物联网1601
学    号    U201614897
邮    箱    479773533@qq.com
课    程    C语言程序设计
作 业 号    习题2.自设题
截止日期    2017年4月14日

简述：
本程序将提示用户输入大写字母，并按照下面金字塔型的格式打印字母：
    A
   ABA
  ABCBA
 ABCDCBA
ABCDEDCBA
******************************************************************************/
#include<stdio.h>

int main(void) {
	char ch;
	printf("请输入一个大写字母: ");
	/*主循环*/
	while (scanf("%c", &ch) != EOF) {
		int n = ch - 'A' + 1;
		int i, j;
		/*外层循环*/
		for (i = 0; i < n; i++) {
			/*打印空格*/
			for (j = 0; j < n - i - 1; j++)
				printf(" ");
			/*升序打印字母*/
			for (j = 0; j < i + 1; j++)
				printf("%c", 'A' + j);
			/*降序打印字母*/
			for (j = 0; j < i; j++)
				printf("%c", 'A' + i - 1 - j);
			printf("\n");
		}
	}
	return 0;
}