/******************************************************************************
文 件 名    HW02_05(选做题)
作    者    潘越
班    级	   物联网1601
学    号    U201614897
邮    箱    479773533@qq.com
课    程    C语言程序设计
作 业 号    习题2.选做题
截止日期    2017年4月14日

简述：
本程序将求解方程3x^3-4x^2-5x+13=0
******************************************************************************/
#include<stdio.h>
#include<math.h>

int main(void) {
	double x, y, dy, d;
	scanf("%lf", &x);
	/*主循环(牛顿迭代法)*/
	do {
		y = 3 * x * x * x - 4 * x * x - 5 * x + 13;
		dy = 9 * x * x - 8 * x - 5;
		d = y / dy;
		x -= d;
	} while (fabs(d) > 1e-6);//判断精度 1e-6
	printf("x=%lf\n", x);
	return 0;
}