/******************************************************************************
文 件 名    HW05_05
作    者    潘越
班    级	   物联网1601
学    号    U201614897
邮    箱    479773533@qq.com
课    程    C语言程序设计
作 业 号    习题5.5
截止日期    2017年5月4日

简述：
本程序输入一个整数，将它在内存中二进制表示的每一位转换成为对应的数字字符，存放到一个字
符数组中，然后输出该整数的二进制表示。
******************************************************************************/
#include <stdio.h>

int main(void) {
	/*size用来获取本机对应的int型二进制长度*/
	int n, i, j, size = sizeof(int) * 4;
	/*储存成绩*/
	int num[100];
	/*储存所有数对应的二进制字符串*/
	char bin[100][100];
	scanf("%d", &n);
	int mask = 1 << (size - 1);
	for (i = 0; i < n; i++)
		scanf("%d", &num[i]);
	/*获取二进制*/
	for (i = 0; i < n; i++) {
		for (j = 0; j < size; j++) {
			bin[i][j] = (num[i] & mask)? '1' : '0';
			num[i] <<= 1;
		}
	}
	/*输出*/
	for (i = 0; i < n; i++) {
		for (j = 0; j < size; j++)
			printf("%c", bin[i][j]);
		printf("\n");
	}
	return 0;
}