/******************************************************************************
文 件 名    HW05_04
作    者    潘越
班    级	   物联网1601
学    号    U201614897
邮    箱    479773533@qq.com
课    程    C语言程序设计
作 业 号    习题5.4
截止日期    2017年5月4日

简述：
本程序从键盘读取数据，对一个3´4矩阵进行赋值，求其转置矩阵，然后输出原矩阵和转置矩阵。
******************************************************************************/
#include <stdio.h>

int main(void) {
	int matrix[3][4];
	int i, j;
	/*第一次，i，j循环输入矩阵*/
	for (i = 0; i < 3; i++)
		for (j = 0; j < 4; j++)
			scanf("%d", &matrix[i][j]);
	/*第二次，i，j循环输出矩阵*/
	for (i = 0; i < 3; i++) {
		for (j = 0; j < 4; j++)
			printf("%5d", matrix[i][j]);
		printf("\n");
	}
	printf("\n");
	/*第三次，j，i循环输出矩阵*/
	for (j = 0; j < 4; j++) {
		for (i = 0; i < 3; i++)
			printf("%5d", matrix[i][j]);
		printf("\n");
	}
	return 0;
}