/******************************************************************************
文 件 名    HW06_02
作    者    潘越
班    级	  物联网1601
学    号    U201614897
邮    箱    479773533@qq.com
课    程    C语言程序设计
作 业 号    习题6.2
截止日期    2017年5月18日

简述：
本程序编写一个函数，它将每一行中连续的多个空格字符压缩为一个空格字符。在调用函数中输出压缩空格
后的各行，空行不予输出。
******************************************************************************/
#include <stdio.h>
/*函数原型：空格压缩*/
void space(char **line, int n);

int main(void) {
    int n;
    scanf("%d", &n);
    getchar();
    /*程序主循环*/
    while (n != 0) {
        int i;
        char ch[100][80];
        char *p[100];
        for (i = 0; i < n; i++) {
            fgets(ch[i], 100, stdin);
            /*给指针数组赋初始值*/
            p[i] = ch[i];
        }
        space(p, n);
        scanf("%d", &n);
        getchar();    
    }
    return 0;
}

/********************************************
函数介绍：空格压缩。
输入参数：
		char **line：二位数组首元素的第一个元素的地址
		int n：行数
输出参数：无
返 回 值：无
********************************************/
void space(char **line, int n) {
    int i;
    for (i = 0; i < n; i++) {
        char ans[1000];
        int flag = 0;
        int j = 0, s = 0;
        while (*(*(line + i) + j) != '\n') {
            if (*(*(line + i) + j) != ' ')
                flag = 0;
            if (flag == 0)
                *(ans + s++) = *(*(line + i) + j);
            if (*(*(line + i) + j) == ' ')
                flag = 1;
            j++;
        }
        *(ans + s) = '\0';
        if (*(ans) != '\0')
            printf("%s\n", ans);
    }
    printf("\n");
}